app/Controllers/Admin.php

SELECT *
FROM `user`
ORDER BY `id_user` ASC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `user`
SELECT *
FROM `app`
WHERE `status_app` = 'Aktif'
---
    public function user()
    {
        // Keyword
        $keyword = $this->request->getVar('keyword');

        if ($keyword) {
            $myuser = $this->user->search($keyword)->orderBy('username ASC')->paginate(10, 'user');
        } else {
            $myuser = $this->user->orderBy('id_user ASC')->paginate(10, 'user');
        }

        // App
        $app = $this->app->where('status_app', 'Aktif')->findAll();

SELECT *
FROM `app`
WHERE `id_app` = '1'
 LIMIT 1
SELECT *
FROM `user`
WHERE `username` = 'admin'
 LIMIT 1
---
    public function user_create()
    {
        $id_app = $this->get['id_app'];
        $app = $this->app->where('id_app', $id_app)->first();

        $username = strtolower($this->get['username']);

        $check_user = $this->user->where('username', $username)->first();