app/Controllers/Login.php

    public function auth()
    {
        $username = $this->get['username'];
        $password = $this->get['password'];

        $check_user = $this->user->where('username', $username)->first();
---
SELECT *
FROM `user`
WHERE `username` = 'admin'
 LIMIT 1